[
  {
    "role": "Back-End Developer",
    "company": "Timely Wills",
    "duration": "4 months",
    "description": "Timely Wills is a comprehensive platform designed to simplify the process of creating and managing essential legal documents, such as wills and powers of attorney. With its user-friendly interface and a range of features, it enables individuals to easily navigate the complexities of estate planning and ensure that their wishes are clearly documented and legally binding.",
    "technologies": [
      "NestJS",
      "Strapi CMS",
      "Postgres",
      "TypeORM",
      "AWS (S3, EC2)",
      "Sendgrid",
      "Stripe",
      "PDF generator"
    ],
    "requirements": [
      "Send emails to users with custom templates",
      "Self-hosted payments",
      "Users can pay by promo codes or get discounts",
      "Users can buy a promo code and send it to a relative via email",
      "PDF generation with flexible templates and various datasets",
      "Users can update documents for 1 year free (then subscription is required)",
      "Generated documents are stored in file storage",
      "Users can access all of their documents and upload signed versions",
      "Users can delete and restore their account"
    ],
    "results": "As a result of my work as a Back-End Developer at Timely Wills, I transformed a concept into a fully functional, intelligent, and user-friendly platform. SendGrid was used for sending emails, Stripe processed payments, AWS handled deployment and file storage, and PDF generation was implemented via the PDF generator API.",
    "previewImage": "timely-wills-preview.png"
  },
  {
    "role": "Back-End Developer",
    "company": "Autofunnel",
    "duration": "5 months",
    "description": "Autofunnel is an AI-powered marketing platform designed to help businesses build and automate their online presence without requiring coding skills. It offers tools to create landing pages, sales funnels, email sequences, eBooks, podcasts, and more.",
    "technologies": [
      "NestJS",
      "GraphQl",
      "MongoDB",
      "Mongoose",
      "Websockets",
      "AWS (S3, EC2, SQS, Cognito, DocumentDB, CloudWatch)",
      "MailGun",
      "Stripe",
      "Open AI"
    ],
    "requirements": [
      "Add internal wallet and credits system",
      "Add unit tests",
      "Configure CI/CD for deploy and running tests",
      "Finish Broadcaster service (Email blast)",
      "Improve admin ui",
      "Fix csv parser",
      "Optimizing search",
      "Fix errors in all services in app"
    ],
    "results": "As a result of my work as a Back-End Developer at Autofunnel, I implemented the email generation and sending system, also set up the payment system and internal wallet, contributed to each part of the system, fixed bugs and optimized the system",
    "previewImage": "autofunnel-preview.png"
  },
  {
    "role": "Back-End Developer",
    "company": "Wonderish",
    "duration": "2 months",
    "description": "Wonderish is an online platform for building websites via vibe-coding. It lets you create websites, landing pages, and apps by simply typing. No code, no setup — just fast, stunning results.",
    "technologies": [
      "NestJS",
      "NextJS",
      "React",
      "Tailwind",
      "Postgresql",
      "Supabase",
      "Websockets",
      "Render",
      "Cloudflare KV store",
      "Cloudflare Custom Domains",
      "Cloudflare R2",
      "Stripe",
      "Kubernetes",
      "Open AI"
    ],
    "requirements": [
      "Create structure of db",
      "Create all required endpoints",
      "Add tools for get file content and folder structure on pod",
      "Add unit tests",
      "Create logic for running, restoring, cleaning pods",
      "Configure Stripe and sandboxes",
      "Configure Supabase and Render for deployment",
      "Configure CI/CD for deploy and running tests",
      "Create admin ui"
    ],
    "results": "As a result of my work as a Back-End Developer at Wonderish, I have fully developed API for data processing for generating sites, deploying pods in kubernetes and their automatic cleaning and creation of snapshots, cloning of already created projects, checkpoint and roleback system, automatic tests for API and for service on python, payment system, admin panel with various statistical data.",
    "previewImage": "wonderish-preview.png"
  },
  {
    "role": "Back-End Developer",
    "company": "TradeVision",
    "duration": "3 months",
    "description": "TradeVision is an online trading platform designed to assist both novice and experienced traders in making informed, data-driven decisions. It offers a variety of tools and features aimed at enhancing trading strategies and optimizing performance.",
    "technologies": [
      "NestJS",
      "Postgresql",
      "TypeORM",
      "Redis",
      "Firebase",
      "Heroku",
      "SendGrid",
      "Stripe",
      "Nx"
    ],
    "results": "As a result of my work as a Back-End Developer at TradeVision, I set up a payment system, set up a microservices system via nx, implemented a referral system, connected firebase for authentication, set up CI/CD.",
    "previewImage": "tradevision-preview.png"
  },
  {
    "role": "Back-End Developer",
    "company": "Catwalk",
    "duration": "2 months",
    "description": "Catwalk is a social network for fashion and clothing.",
    "technologies": [
      "NestJS",
      "Postgresql",
      "TypeORM",
      "Firebase",
      "GCP (Cloud SQL, API Gateway, Cloud Build, Cloud Vision API, Artifact Registry)",
      "Nx"
    ],
    "results": "As a result of my work as a Back-End Developer at Catwalk, I created an API for uploading, checking images for inappropriate content, blurring images, building vectors, and also a firebase authorization module."
  },
  {
    "role": "Back-End Developer",
    "company": "AceFace AI",
    "duration": "3 months",
    "description": "AceFace is an AI-driven platform that transforms your selfies into hyper-realistic, professional-grade headshots in under 3 minutes—without needing a photographer or subscription.",
    "technologies": [
      "NextJS",
      "NestJS",
      "Postgresql",
      "Supabase",
      "Vercel",
      "Stripe",
      "Resend",
      "Jszip",
      "Fal Ai"
    ],
    "results": "As a result of my work as a Back-End Developer at AceFace AI, I created an API for processing payments, train LLM via user's photos and than generate a new one with selected styles, zipping input and output photos, supabase integration.",
    "previewImage": "aceface-preview.png"
  },
  {
    "role": "Back-End Developer",
    "company": "AeoVision",
    "duration": "4 month",
    "description": "AEO stands for Answer Engine Optimization - the modern counterpart to SEO. While SEO helps you rank in search engine results pages, AEO helps ensure your brand is the answer in AI-generated responses from tools like ChatGPT, Gemini, and Perplexity.",
    "technologies": [
      "NestJS",
      "Postgresql",
      "Redis",
      "GraphQl",
      "Render",
      "Stripe",
      "Open AI",
      "Gemini",
      "Claude",
      "Perplexity",
      "Postmark",
      "P-limit",
      "Reddit API"
    ],
    "results": "As a result of my work as a Back-End Developer at AeoVision, I optimized an API for processing brand analytics via prompts by batching and running in parallel, fixed bugs, implemented additional analytics. Also I implemented integration with reddit for collecting brand mentions.",
    "previewImage": "aeovision-preview.png"
  },
  {
    "role": "Back-End Developer",
    "company": "Rebatr",
    "duration": "2 month",
    "description": "Rebatr is online platform for sellers and shoppers. Here sellers can offer use discounts for their products and shoppers get products for lower price.",
    "technologies": [
      "NestJS",
      "Postgresql",
      "Prisma",
      "Jwt",
      "Resend",
      "Swagger",
      "Cloudflare R2",
      "Render"
    ],
    "results": "As a result of my work as a Back-End Developer at Rebatr, I fully developed REST API for app including: Amazon scrapper, role-base access, auth module, statistics endpoints, storage management and deployment.",
    "previewImage": "rebatr-preview.png"
  },
  {
    "role": "Back-End Developer",
    "company": "Movesmethod",
    "duration": "2 month",
    "description": "Movesmethod is mobile fitness app for every day. It gives user every day movement with detail instructions, offer weekly statistic and body analyze.",
    "technologies": [
      "Vite",
      "NestJs",
      "Postgresql",
      "Supabase",
      "RCP-functions",
      "Supabase Edge functions",
      "RLS",
      "SendGrid",
      "Mixpanel",
      "APN",
      "Swagger",
      "Zod",
      "Sonner",
      "Tailwind",
      "Shadcn",
      "Render"
    ],
    "results": "As a result of my work as a Back-End Developer at Movesmethod, I improved database schema, add rcp functions, configured RLS, implemented web admin panel for edit app content, implement scheduled notifications throw apn.",
    "previewImage": "movesmethod-preview.png"
  }
]